[
  "ThonnyMenuBar: A menu bar component that mimics desktop application menus.",
  "ThonnyToolbar: A toolbar containing icons for common actions like new file, save, run, stop.",
  "ThonnyEditor: A Monaco-based code editor configured for Python.",
  "ThonnyBottomPanel: A tabbed panel at the bottom for Shell, Exception, ProgramTree, TODO, and Plotter.",
  "ThonnyRightPanel: A tabbed panel on the right for Variables and Outline.",
  "ThonnyVariables: Displays current variable values.",
  "ThonnyOutline: Shows the structure (functions, classes) of the code.",
  "ThonnyPlotter: A simple line chart plotter that detects numbers printed to stdout.",
  "AstTree: A recursive component to visualize the Abstract Syntax Tree (AST).",
  "PackageManagerDialog: A dialog to search, install, and remove Pyodide-compatible packages.",
  "ThonnyInfoSection: An informational section explaining the tool features and usage.",
  "Toast: A notification system for success/error messages.",
  "InputDialog: A modal for getting user input (e.g., filename).",
  "useThonnyPyodide: A composable managing the Pyodide worker, code execution, AST/Outline generation, and package management.",
  "Main Layout: Resizable 2-column layout (Editor+BottomPanel | RightPanel) with resizable rows (Editor | BottomPanel).",
  "File Management: Create, delete, rename (save as), and switch between multiple local files (stored in localStorage).",
  "Code Execution: Asynchronous execution of Python code via Web Worker.",
  "Shell: Interactive REPL that accepts commands and displays types of output (stdout, error, system info).",
  "AST generation: Generates and displays Python AST using the `ast` module.",
  "Outline generation: Parses code to extract function and class definitions for navigation.",
  "TODO scanning: regex-based scanning of comments for TODO/FIXME tags.",
  "Package Management: Interface to `micropip` for installing PyPI packages.",
  "Debounced Updates: Outline and AST updates are debounced on code change and run immediately on execution.",
  "Mobile Responsiveness: Responsive design adjustments for smaller screens (though primarily desktop-focused layout)."
]
